`LIMPIEZA IV`

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
import sidetable

In [3]:

df=pd.read_csv('../Datos/attacks_limpieza_III.csv')
df.head(2)

,case_number,year,type,country,area,location,activity,name,time,species,siglo,species_,injury,mes,fatal_bien,genero_bien,categorias_tiburones,edades
0,2018.06.25,2018,Boating,usa,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,18h00,White shark,siglo - XXI,NaN,"No injury to occupant, outrigger canoe and pad...",Jun,N,F,White,57.0
1,2018.06.03.a,2018,Unprovoked,brazil,Pernambuco,"Piedade Beach, Recife",Swimming,Jose Ernesto da Silva,Late afternoon,Tiger shark,siglo - XXI,NaN,FATAL,Jun,Y,M,Tiger,18.0

Es el momento de ponernos a trabajar con los valores nulos üí™üèΩ. A lo largo de este ejercicio de pair programming vamos a intentar eliminar los valores nulos de nuestras columnas. En la lecci√≥n hemos aprendido varios m√©todos, nosotras os planteamos los ejercicios pero sentiros libres de usar el m√©todo que m√°s se adapte a vuestras necesidades. Manos a la obra!

1. Lo primero que tenemos que evaluar es en que columnas tenemos nulos y que cantidad tenemos en cada una. ¬øHay alguna columna con una gran cantidad de nulos? En caso de que sea as√≠ deberemos eliminarla.

In [4]:
df.stb.missing()

                      missing  total    percent
species_                 1628   1672  97.368421
categorias_tiburones     1002   1672  59.928230
species                   170   1672  10.167464
siglo                     170   1672  10.167464
time                      160   1672   9.569378
edades                    158   1672   9.449761
mes                       154   1672   9.210526
fatal_bien                 99   1672   5.921053
location                   51   1672   3.050239
area                       46   1672   2.751196
activity                   31   1672   1.854067
country                    10   1672   0.598086
name                        9   1672   0.538278
injury                      8   1672   0.478469
year                        0   1672   0.000000
genero_bien                 0   1672   0.000000
type                        0   1672   0.000000
case_number                 0   1672   0.000000

In [5]:
#descubrimos que la columna species_ contiene el 97% de nulos y tambi√©n tenemos una columna con el 10% de nulos que contiene la misma informaci√≥n por lo que eliminaremos la primera.

df=df.drop('species_', axis=1)
df.head(2)

,case_number,year,type,country,area,location,activity,name,time,species,siglo,injury,mes,fatal_bien,genero_bien,categorias_tiburones,edades
0,2018.06.25,2018,Boating,usa,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,18h00,White shark,siglo - XXI,"No injury to occupant, outrigger canoe and pad...",Jun,N,F,White,57.0
1,2018.06.03.a,2018,Unprovoked,brazil,Pernambuco,"Piedade Beach, Recife",Swimming,Jose Ernesto da Silva,Late afternoon,Tiger shark,siglo - XXI,FATAL,Jun,Y,M,Tiger,18.0

2. Es el momento de eliminar los nulos:
Reemplazad los valores nulos de la columna age por la media de la edad, redondeada a dos decimales.

In [7]:
df["edades"].replace(np.nan, df["edades"].mean(), inplace = True)
df["edades"]=df["edades"].round(decimals=2)
df["edades"].isnull().sum()

0

In [8]:
df.edades.info()

<class 'pandas.core.series.Series'>
RangeIndex: 1672 entries, 0 to 1671
Series name: edades
Non-Null Count  Dtype
--------------  -----
1672 non-null   float64
dtypes: float64(1)
memory usage: 13.2 KB

En relaci√≥n a la columna de country al tratarse de una columna de tipo categ√≥rica, reemplazad los valores nulos por una nueva categ√≥ria que se llame Unknown.

In [9]:
df["country"].replace(np.nan, "Unknow", inplace = True)
df["country"].isnull().sum()

0

Reemplazad los valores nulos de la columna fatal por Unknown.

In [10]:
df["fatal_bien"].replace(np.nan, "Unknow", inplace = True)
df["fatal_bien"].isnull().sum()

0

In [11]:
df.fatal_bien.unique()

array(['N', 'Y', 'Unknow'], dtype=object)

Reemplazad los valores nulos de la columna type por el valor m√°s frecuente (la moda).

In [12]:
df["type"].replace(np.nan, df.type.mode()[0], inplace = True)
df["type"].isnull().sum()

0

Reemplazad los valores nulos de la columna fecha por Unknown.

In [13]:
df["mes"].replace(np.nan, "Unknow", inplace = True)
df["mes"].isnull().sum()

0

3. Guardad el csv para seguir trabajando con el en los siguientes ejercicios de pair.